Revit 2024 API
CylindricalHelix.Create Method
 Create a cylindrical helix.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static CylindricalHelix Create(
	XYZ basePoint,
	double radius,
	XYZ xVector,
	XYZ zVector,
	double pitch,
	double startAngle,
	double endAngle
)
Visual Basic
Public Shared Function Create ( _
	basePoint As XYZ, _
	radius As Double, _
	xVector As XYZ, _
	zVector As XYZ, _
	pitch As Double, _
	startAngle As Double, _
	endAngle As Double _
) As CylindricalHelix
Visual C++
public:
static CylindricalHelix^ Create(
	XYZ^ basePoint,
	double radius,
	XYZ^ xVector,
	XYZ^ zVector,
	double pitch,
	double startAngle,
	double endAngle
)
Parameters
basePoint
Type: Autodesk.Revit.DB.XYZ
 Base point of the axis. It can be any point in 3d.
radius
Type: System.Double
 Radius. It should be a positive number.
xVector
Type: Autodesk.Revit.DB.XYZ
 X vector. Should be Non-zero vector.
zVector
Type: Autodesk.Revit.DB.XYZ
 Z vector = axis direction. Should be non-zero and orthogonal to X Vector.
pitch
Type: System.Double
 Pitch. It should be non-zero number, can be positive or negative. Positive means right handed and negative means left handed.
startAngle
Type: System.Double
 Start angle. It specifies the start point of the Helix.
endAngle
Type: System.Double
 End angle. It specifies the end point of the Helix. End angle should not be equal to start angle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The radius is negative -or- the pitch is zero -or- the xVector or zVector is zero length -or- zVector is not orthogonal to xVector -or- endAngle is equal to startAngle.
See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace